<?php

return [
    'title' => 'ផ្ទាំងការងារ',
    'total_users' => 'ចំនួនអ្នកប្រើសរុប',
    'active_users' => 'អ្នកប្រើដែលកំពុងសកម្ម',
    'most_active_user' => 'អ្នកប្រើដែលសកម្មជាងគេ',
    'points' => 'ពិន្ទុ',
    'filter' => 'តម្រង',
    'reset' => 'សំអាត',
    'start_date' => 'ថ្ងៃចាប់ផ្តើម',
    'end_date' => 'ថ្ងៃបញ្ចប់',
    'daily_stat' => 'ស្ថិតិការសម្អាតប្រចាំថ្ងៃ (តាមអគារ)',
    'total_point' => 'ពិន្ទុសរុបដោយអ្នកប្រើ',
    'title_dashboard' => 'ផ្ទាំងការងារ',
    'logout' => 'ចាកចេញដោយជោគជ័យ!',
]; 
 