<?php

return [
    'success_add'   => 'ទិន្នន័យសមាជិកត្រូវបានបន្ថែមដោយជោគជ័យ!',
    'success_edit'  => 'ទិន្នន័យត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ។',
    'success_deleted' => 'ទិន្នន័យកម្មករត្រូវបានលុបដោយជោគជ័យ។',

    'title_index'   => 'ទំព័រកម្មករ | ផ្ទាំងការងារ',
    'title_create'  => 'បន្ថែមកម្មករ | ផ្ទាំងការងារ',
    'title_show'    => 'ពត័មានលម្អិតកម្មករ | ផ្ទាំងការងារ',
    'title_edit'    => 'កែប្រែកម្មករ | ផ្ទាំងការងារ',

    'store' => [
        'name_required'        => 'ឈ្មោះជាសារពើភ័ណ្ឌ។',
        'username_required'    => 'ឈ្មោះអ្នកប្រើជាសារពើភ័ណ្ឌ។',
        'username_unique'      => 'ឈ្មោះអ្នកប្រើនេះត្រូវបានប្រើរួចហើយ។ សូមជ្រើសរើសឈ្មោះផ្សេងទៀត។',
        'email_required'       => 'អ៊ីមែលជាសារពើភ័ណ្ឌ។',
        'email_unique'         => 'អ៊ីមែលនេះត្រូវបានចុះឈ្មោះរួចហើយ។',
        'password_required'    => 'ពាក្យសម្ងាត់ជាសារពើភ័ណ្ឌ។',
        'password_min'         => 'ពាក្យសម្ងាត់ត្រូវតែយ៉ាងហោចណាស់ 6 តួអក្សរ។',
        'phone_required'       => 'លេខទូរស័ព្ទជាសារពើភ័ណ្ឌ។',
        'gender_in'            => 'សូមជ្រើសរើសភេទដែលមានសុពលភាព។',
        'photo_error'          => 'ឯកសារដែលបានជ្រើសរើសត្រូវតែជារូបភាព។',
        'photo_mimes'          => 'រូបភាពត្រូវតែជាប្រភេទ jpeg, png, jpg, ឬ gif ។',
        'photo_max'            => 'ទំហំរូបភាពមិនអាចលើសពី 2MB ។',
    ],

    'upload' => [
        'name_required'        => 'ឈ្មោះជាសារពើភ័ណ្ឌ។',
        'username_required'    => 'ឈ្មោះអ្នកប្រើជាសារពើភ័ណ្ឌ។',
        'username_unique'      => 'ឈ្មោះអ្នកប្រើនេះត្រូវបានប្រើរួចហើយ។ សូមជ្រើសរើសឈ្មោះផ្សេងទៀត។',
        'email_required'       => 'អ៊ីមែលជាសារពើភ័ណ្ឌ។',
        'email_unique'         => 'អ៊ីមែលនេះត្រូវបានចុះឈ្មោះរួចហើយ។',
        'password_required'    => 'ពាក្យសម្ងាត់ជាសារពើភ័ណ្ឌ។',
        'password_min'         => 'ពាក្យសម្ងាត់ត្រូវតែយ៉ាងហោចណាស់ 6 តួអក្សរ។',
        'phone_required'       => 'លេខទូរស័ព្ទជាសារពើភ័ណ្ឌ។',
        'gender_in'            => 'សូមជ្រើសរើសភេទដែលមានសុពលភាព។',
        'photo_error'          => 'ឯកសារដែលបានជ្រើសរើសត្រូវតែជារូបភាព។',
        'photo_mimes'          => 'រូបភាពត្រូវតែជាប្រភេទ jpeg, png, jpg ឬ gif ។',
        'photo_max'            => 'ទំហំរូបភាពមិនអាចលើសពី 2MB ។',
        'role_required'        => 'ត្រូវជ្រើសរើសតួនាទី។',
        'role_in'              => 'តួនាទីត្រូវតែជា អ្នកប្រើ ឬ អ្នកគ្រប់គ្រង។',
        ],


];
